cask_args appdir: '/Applications'

tap 'homebrew/versions'
tap 'homebrew/dupes'
tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'git'
brew 'git-extras'
brew 'gnu-sed' args:['with-default-names']
brew 'grep' args:['with-default-names']
brew 'hub'
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'imagemagick' args:['with-webp']
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'rbenv'
brew 'readline'
brew 'ruby-build'
brew 'unrar'
brew 'wget'

cask 'flux'
cask 'dash'
cask 'iterm2'
cask 'atom'
cask 'malwarebytes-anti-malware'
cask 'glimmerblocker'
cask 'macdown'
cask 'spotify'
cask 'tunnelbear'

# Quick Look plugins - see: https://github.com/sindresorhus/quick-look-plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
